src/main/resources/doReissueCommit_ByPasOdemeReissueTekSegment_mco.text

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">   <SOAP-ENV:Header/>   <S:Body>      <OrderChangeRQ Version="IATA2017.2" xmlns="http://www.iata.org/IATA/EDIST/2017.2">         <Document>            <Name>PC NDC GATEWAY</Name>            <ReferenceVersion>1.0</ReferenceVersion>         </Document>         <Party>            <Sender>               <TravelAgencySender>                  <Contacts>                     <Contact>                        <EmailContact>                           <Address>ticketing@airtuerk.de</Address>                        </EmailContact>                     </Contact>                  </Contacts>                  <AgencyID>PC NDC</AgencyID>                  <AgentUser>                     <Name>HITITADMIN</Name>                     <AgentUserID>T621OC48</AgentUserID>                  </AgentUser>               </TravelAgencySender>            </Sender>         </Party>         <Query>            <OrderID Owner="PC">replaceOrderId</OrderID>    <Payments>     <Payment>  <Type>MCO</Type>       <Method>  <MiscChargeOrder>	<TicketNumber>4059008706</TicketNumber>			</MiscChargeOrder>             </Method>                  <Amount Code="TRY">replaceNewPrice</Amount>               </Payment>            </Payments>            <OrderServicing>               <AcceptOffer>                  <Offer OfferID="ReissueOffer1" Owner="PC" ResponseID="replaceNewResponseId">                     <OfferItem OfferItemID="replaceReshopOfferId"/>                  </Offer>               </AcceptOffer>                              <Delete>                                 <OrderItemID>replaceSegmentId</OrderItemID>            </Delete>                           </OrderServicing>            <OrderChangeMetadata>               <Other>                  <OtherMetadata>                     <CurrencyMetadatas>                        <CurrencyMetadata MetadataKey="TRY"/>                     </CurrencyMetadatas>                  </OtherMetadata>               </Other>            </OrderChangeMetadata>         </Query>      </OrderChangeRQ>   </S:Body></S:Envelope>
